[
  {
    "title": "Coming Soon......",
    "slug": "coming-soon-",
    "filename": "Causal Inference To Minimize Supply Chain Delays a.pdf",
    "thumb_url": "static/images/Document1 - WPS Office 22_05_2025 17_36_57.png",
    "upload_date": "2025-05-22",
    "dir": "Causal Inference To Minimize Supply Chain Delays a",
    "related_files": [
      "Causal Inference To Minimize Supply Chain Delays a.pdf"
    ],
    "web_link": "",
    "model_link": "",
    "abstract": "",
    "conclusion": "",
    "objectives": "",
    "summary": ""
  },
  {
    "title": "Designing and Deploying AI Models for Sustainable Logistics Optimization: A Case Study on Eco-Efficient Supply Chains in the USA",
    "slug": "designing-and-deploying-ai-models-for-sustainable-logistics-optimization-a-case-study-on-eco-efficient-supply-chains-in-the-usa",
    "filename": "Coming Soon.pdf",
    "thumb_url": "static/images/Document1 - WPS Office 22_05_2025 17_36_57.png",
    "upload_date": "2025-05-22",
    "dir": "Designing and Deploying AI Models for Sustainable Logistics",
    "related_files": [
      "Coming Soon.pdf",
      "Logistics_Optimization.html",
      "Logistics_Optimization.ipynb"
    ],
    "web_link": "https://logistics-opt.streamlit.app/",
    "model_link": "https://colab.research.google.com/drive/1_MV1214VfuomAmPAYwctS4sWm_M10a1L?usp=sharing",
    "abstract": "The rapid evolution of Artificial Intelligence (AI) and Machine Learning (ML) has significantly transformed logistics and supply chain management, particularly in the pursuit of sustainability and eco-efficiency. This study explores AI-based methodologies for optimizing logistics operations in the USA, focusing on reducing environmental impact, improving fuel efficiency, and minimizing costs. Key AI applications include predictive analytics for demand forecasting, route optimization through machine learning, and AI-powered fuel efficiency strategies. Various models, such as Linear Regression, XGBoost, Support Vector Machine, and Neural Networks, are applied to real-world logistics datasets to reduce carbon emissions based on logistics operations, optimizing travel routes to minimize distance and travel time , and predict future deliveries to plan optimal routes. Other models such as K-Means and DBSCAN are also used to optimize travel routes to minimize distance and travel time for logistics operations. This study utilizes datasets from logistics companies' databases. The study also assesses model performance using metrics such as mean absolute error (MAE), mean squared error (MSE), and R² score. This study also explores how these models can be deployed to various platforms for real-time use in the logistics and supply chain sector. The models are also examined through a thorough case study, highlighting best practices and regulatory frameworks that promote sustainability. The findings demonstrate AI's potential to enhance logistics efficiency, reduce carbon footprints, and contribute to a more resilient and adaptive supply chain ecosystem.",
    "conclusion": "This study effectively demonstrates the significant impact of artificial intelligence (AI) and machine learning (ML) on optimizing logistics operations, reducing carbon emissions, and enhancing sustainability in the U.S. supply chain sector. By harnessing the power of predictive analytics, optimizing routing models, and utilizing AI-driven demand forecasting, businesses can achieve greater efficiency, minimize operational costs, and align their logistics strategies with environmental sustainability goals.  The research utilized various AI techniques, including Linear Regression, XGBoost, Support Vector Machines, Neural Networks, and clustering algorithms such as K-Means and DBSCAN, to analyze logistics datasets. The results indicate that AI-driven models significantly improve transportation efficiency by reducing fuel consumption, optimizing delivery routes, and identifying outlier transit patterns. Additionally, applications of AI like reinforcement learning and deep learning have shown effectiveness in real-time traffic prediction and adaptive decision-making within logistics.",
    "objectives": "This research aims to develop and deploy AI-driven models for optimizing logistics operations with a strong emphasis on sustainability. The specific objectives of the study include predicting demand and enhancing supply chain efficiency by implementing machine learning models such as Linear Regression, XGBoost, and Neural Networks to improve demand forecasting and supply chain management. Additionally, the research focuses on optimizing travel routes to minimize distance and travel time, utilizing clustering techniques such as K-Means and DBSCAN to determine the most efficient delivery routes, which would help reduce fuel consumption and emissions. Another key aspect of the study is enhancing fuel efficiency and reducing carbon footprints by developing AI-powered strategies that aim to lower overall logistics costs while also minimizing environmental impact. The research further evaluates model performance and deployment feasibility by assessing the AI models using various performance metrics, including mean absolute error (MAE), mean squared error (MSE), and R² score, while also exploring deployment strategies for real-time logistics applications. Finally, the study seeks to align AI-driven logistics solutions with sustainability policies by examining regulatory frameworks and industry best practices to ensure compliance with environmental sustainability goals.",
    "summary": ""
  },
  {
    "title": "Building Robust AI and Machine Learning Models For Supplier Risk Management: A Data-Driven Strategy For Enhancing Supply Chain Resilience In The USA",
    "slug": "building-robust-ai-and-machine-learning-models-for-supplier-risk-management-a-data-driven-strategy-for-enhancing-supply-chain-resilience-in-the-usa",
    "filename": "Coming Soon.pdf",
    "thumb_url": "static/images/Document1 - WPS Office 22_05_2025 17_36_57.png",
    "upload_date": "2025-05-22",
    "dir": "Building_Robust_AI_and_Machine_Learning_Models_For_Supply_Risk[1]",
    "related_files": [
      "Coming Soon.pdf",
      "Supply_risk.html",
      "Supply_Risk.ipynb"
    ],
    "web_link": "",
    "model_link": "https://colab.research.google.com/drive/1vIu1i5O8hbbH3kPuNUikY5jbhOLNWKYl?usp=sharing",
    "abstract": "The increasing complexity and vulnerability of modern supply chains, exacerbated by geopolitical tensions, climate variability, and fraudulent activities, highlights the need for robust AI-driven risk management solutions. This research presents a unified, data-driven framework that utilizes machine learning (ML), deep learning (DL), and reinforcement learning (RL) to enhance supplier risk resilience and optimize logistics under disruptive conditions. We start by using a comprehensive dataset of 1,000 supplier transactions, enriched with historical demand, weather indices, geopolitical risk scores, shipment anomalies, and financial health indicators. We apply various regression models, including Linear Regression, Random Forest Regressor, XGBoost Regressor, and Multi-Layer Perceptron, to forecast future demand and quantify supplier risk, assessing performance with metrics such as Mean Absolute Error (MAE), Mean Squared Error (MSE), and R². Next, we employ Isolation Forests for real-time disruption detection, analyzing features like price spike percentages, delivery delays, and sentiment scores to enable the early identification of anomalous events. To optimize dynamic routing in the face of stochastic disruptions, we design a custom Open-AI Gym environment and train a Deep Q-Network (DQN) agent that balances fuel costs, delays, and penalties for anomalies, evaluating the strategy's effectiveness through cumulative reward analyses. Finally, for transactional fraud detection, we build a deep neural network using a synthetic fraud dataset, applying SMOTE for class balancing. This results in near-perfect accuracy (>99.9%), as validated by train/validation loss curves and classification reports.  The integrated framework provides end-to-end supplier risk analytics, combining predictive forecasting, anomaly detection, route optimization, and fraud identification to support resilient decision-making in supply chain operations. Key evaluation metrics include MAE, MSE, and R² for forecasting; contamination rates for anomaly detection; cumulative rewards for reinforcement learning performance; and accuracy, precision, recall, and AUC for fraud classification.",
    "conclusion": "This research presents a comprehensive, AI-driven framework for managing supplier risk, specifically designed to address the complexities of U.S. supply chains. The framework integrates several advanced techniques: predictive risk scoring using supervised learning models, real-time anomaly detection through Isolation Forests, dynamic route optimization via reinforcement learning, and fraud detection based on deep neural networks.  The study demonstrates the effectiveness of transitioning from traditional, reactive approaches to proactive, data-driven risk mitigation. Empirical evaluations show significant improvements in forecasting accuracy, anomaly detection precision, delivery efficiency, and fraud detection rates. Real-world applications by major U.S. corporations and government initiatives highlight the tangible economic benefits, which include reduced lead time variability, lower logistics costs, and enhanced regulatory compliance.",
    "objectives": "The primary objective of this research is to design, implement, and evaluate a comprehensive AI-driven framework for supplier risk management, aimed at enhancing resilience and operational efficiency across U.S. supply chains.  First, the study aims to develop predictive models that can forecast the likelihood of a supplier failing to deliver, based on historical demand, financial indicators, geopolitical scores, and behavioral patterns. The performance targets for these models include achieving a mean absolute error (MAE) of less than 50 units of demand and an R² score greater than 0.7 on hold-out test data. Second, the research seeks to enable real-time disruption detection by applying unsupervised machine learning techniques, such as Isolation Forests and autoencoders. This will allow for continuous monitoring of key risk features, including price spikes, delivery delays, and sentiment shifts. The hypothesis is that the anomaly detection system will identify at least 90 percent of true disruptions while maintaining a false alarm rate of under 10 percent. Third, the study intends to optimize travel routes under stochastic risk scenarios by developing a reinforcement learning agent trained in a simulated logistics environment. The goal is to reduce average delivery delays by at least 15 percent and fuel-cost penalties by 10 percent compared to baseline routing heuristics. Additional objectives include evaluating the operational integration of these models—such as deploying the DQN-based routing policy in a proof-of-concept application using Streamlit or, preferably, Flask—and establishing guidelines for model retraining and scalability.",
    "summary": " "
  },
  {
    "title": "Developing and Implementing AI-Driven Models for Demand Forecasting in US Supply Chains: A Comprehensive Approach to Enhancing Predictive Accuracy",
    "slug": "developing-and-implementing-ai-driven-models-for-demand-forecasting-in-us-supply-chains-a-comprehensive-approach-to-enhancing-predictive-accuracy",
    "filename": "Coming Soon.pdf",
    "thumb_url": "static/images/Document1 - WPS Office 22_05_2025 17_36_57.png",
    "upload_date": "2025-05-22",
    "dir": "Update_Supply_01_Demand_Forecasting_In_US_Supply_Chain_Operations_082100[1]",
    "related_files": [
      "Demand_Forecasting_In_US_Supply_Chains.html",
      "Demand_Forecasting_In_US_Supply_Chains.ipynb",
      "Coming Soon.pdf"
    ],
    "web_link": "",
    "model_link": "https://colab.research.google.com/drive/1LqHhvZtaO5By9gdbF7-Dv8SJEKT2znZe?usp=sharing",
    "abstract": "Demand forecasting has long been a critical challenge in the US supply chain operations, plagued by disruptions, fluctuating demand, and price volatility. Developing and implementing AI models that can accurately predict demand is essential in response to these issues. This study aimed to investigate the feasibility of applying machine learning techniques to demand forecasting, particularly in supply chain operations. A comprehensive analysis was conducted using historical data from a logistics company in the USA, which was used to train five traditional demand forecasting methods: Linear Regression, ElasticNet, Random Forest, MLPRegressorn, and XGBoost. Additionally, feature selection, data normalization, and dimensionality reduction techniques were employed to improve the accuracy of these models. Strategic metrics were used to evaluate the model's performance: Random Mean Squared Error, Mean Absolute Error, and R-squared score. The results of this study indicate that AI models have shown significant promise in predicting target sales in supply chains with Linear Regression emerging as the most effective model with the lowest RMSE, MAE, and an R-squared score close to 1. Practical implications of implementing such AI models in the US supply chain include optimized inventory management, reduced costs, and enhanced customer satisfaction. This research contributes to the existing body of knowledge on AI applications in demand forecasting, highlights the importance of traditional methods being supplemented by machine learning techniques, and provides practical recommendations for businesses seeking to improve their supply chain operations.",
    "conclusion": "In conclusion, this research demonstrates the transformative potential of AI-driven models in enhancing demand forecasting accuracy within US supply chains...",
    "objectives": "In this research, we aim to develop and implement AI-driven models for demand forecasting in US supply chains. Our work will explore the potential of AI technologies, such as neural networks and decision trees, in improving predictive accuracy and enhancing the interpretability of forecasted demands. We will also examine the challenges associated with integrating these models into existing supply chain operations, including data quality, model deployment, and maintenance. By developing a comprehensive approach to demand forecasting using AI-driven models, we believe that US businesses can enhance their ability to respond effectively to changing market conditions, minimize losses, and improve overall supply chain performance. This research will contribute to the growing implementation of AI-powered demand forecasting in supply chains, providing insights into the benefits, challenges, and best practices for implementing these technologies in real-world scenarios.",
    "summary": "Linear Regression emerged as the clear winner in terms of model performance, boasting the lowest Root Mean Squared Error (RMSE), Mean Absolute Error (MAE), and Positive R-squared scores among all the trained models. This is unsurprising, given its historical success in regression problems involving continuous data. The Linear Regression model demonstrated an impressive ability to accurately predict Target Sales, with a low RMSE score of 0.9853973287715153. In contrast, other models performed significantly worse, with higher MAE and negative R-squared scores. Random Forest, XGBoost, and MLPRegressor trailed behind in terms of performance. Random Forest exhibited the highest RMSE, MAE, and Negative R-squared score among all models, indicating a moderate level of accuracy but also significant variability. XGBoost showed respectable results, with lower RMSE but higher MAE and Negative R-squared scores. However, its poor Positive R-squared score suggested limited explanatory power. In stark contrast to these models, ElasticNet demonstrated exceptional performance, boasting the lowest Negative R-squared score among all models. Its positive Positive R-squared score (0.9880205912676231) further indicated high accuracy in predicting Target Sales. While its RMSE and MAE scores were not as low as Linear Regression's, they were significantly lower than those of other models. Finally, a comparison of the R-squared values among all models revealed that they were highly correlated but distinct in their explanatory power. Linear Regression had an R-squared score closest to 1, indicating an excellent fit to the underlying relationship between Target Sales and the input features. In contrast, other models had significantly lower R-squared scores, suggesting limited explanatory power. Based on the performance metrics, Linear Regression emerges as the best-suited model for demand forecasting in USA supply chains. Its high RMSE score of 0.9853973287715153 and positive R-squared score of 0.0033968179947365673 demonstrate its exceptional accuracy and robustness. The other models, while performing in some respects, have significant limitations in terms of explanatory power and model fit. AI-driven models offer significant improvements in predictive accuracy compared to traditional forecasting methods. Linear Regression and ElasticNet, for instance, provide robust performance in handling non-linear relationships, allowing for accurate predictions across various domains. In contrast, time series analysis relies on patterns and trends, which can be challenging to capture with AI-driven models. Qualitative forecasting, while essential in certain industries, often requires domain-specific knowledge, whereas AI models can handle vast amounts of data without relying on expert judgment. CPFR and Delphi methods are more suitable for exploratory data analysis and scenario planning, respectively, rather than predictive modeling. Simulation models and causal inferences require a deep understanding of complex systems, making them less suitable for AI-driven approaches. Consumer surveys, while valuable for market research, may not be as effective in predicting future trends due to their limited scope."
  }
]
